doc/s-sql-c.org
#+TITLE: S-SQL Examples C
#+OPTIONS: num:nil
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="style.css" />
#+HTML_HEAD: <style>pre.src{background:#343131;color:white;} </style>
#+OPTIONS: ^:nil

* [[file:s-sql-examples.org][S-SQL Examples Home Page]]
| [[file:s-sql-a.org][A]]| [[file:s-sql-b.org][B]]| [[file:s-sql-c.org][C]]| [[file:s-sql-d.org][D]]| [[file:s-sql-e.org][E]]| [[file:s-sql-f.org][F]]| [[file:s-sql-g.org][G]]| [[file:s-sql-h.org][H]]| [[file:s-sql-i.org][I]]| [[file:s-sql-j.org][J]]| [[file:s-sql-k.org][K]]| [[file:s-sql-l.org][L]]| [[file:s-sql-m.org][M]]| [[file:s-sql-n.org][N]]| [[file:s-sql-o.org][O]]| [[file:s-sql-p.org][P]]| [[file:s-sql-r.org][R]]| [[file:s-sql-s.org][S]]| [[file:s-sql-t.org][T]]| [[file:s-sql-u.org][U]]| [[file:s-sql-v.org][V]]| [[file:s-sql-w.org][W]]|  [[file:s-sql-special-characters.org][Special Characters]]                        |  [[file:calling-postgresql-stored-functions.org][Calling Postgresql Stored Functions and Procedures]]|

* Call
  :PROPERTIES:
  :CUSTOM_ID: call
  :END:
Call is used to call a Postgresql Procedure. This cannot be used in a select clause. You can pass variables to the operator.
#+begin_src lisp
  (query (:call 'set_x_procedure 1 13))

  (let ((a 1) (b 2))
    (query (:call 'my-proc a b 3)))

  (let ((a 1) (b 2) (p 'my-proc))
    (query (:call p a b 3)))
#+end_src
* Case
  :PROPERTIES:
  :CUSTOM_ID: case
  :END:
As you know, case is a conditional expression that you can use to either search for rows in a table when a condition is true or compare a table field to a statement in the case expression. So consider the following where you only look at the first 10 rows in the countries table. The Case expression indicates that if the id is less than five, return the word "Low" and if the id is greater than five, return the word "high". Notice what happens when Denmark, with an id of exactly five, gets returned.
#+begin_src lisp
  (query (:select 'id 'name
                (:case
                 ((:< 'id 5) "Low")
                 ((:> 'id 5) "High"))
                :from 'countries
                :where (:< 'id 10))))

((1 "Austria" "Low") (2 "Belgium" "Low") (4 "Canada" "Low") (5 "Denmark" :NULL)
 (8 "France" "High") (9 "Germany" "High") (7 "Finland" "High"))

#+end_src

* Cast
  :PROPERTIES:
  :CUSTOM_ID: cast
  :END:
There are two ways to cast in postmodern. First is the explicit use of cast as in:
#+begin_src lisp
(query (:select (:cast (:as "2018-04-19" 'date)) :from 'roadmap))
#+end_src

Then there is the use of the type operator which effectively translates into postgresql's :: casting shortcut.
#+begin_src lisp
(query (:select (:type "2018-04-19" date) :from 'roadmap))
#+end_src

Note that the targetted data type is quoted in the explicit use of cast and not quoted when using type.

* Coalesce
  :PROPERTIES:
  :CUSTOM_ID: coalesce
  :END:
The COALESCE function in SQL returns the first non-NULL expression among its arguments.
#+begin_src lisp
  (query
   (:order-by
    (:select (:as 'countries.name  'country)
             (:as (:coalesce 'countries.latitude  999)
                  'latitude)
             (:as (:coalesce 'countries.longitude 999)
                  'longitude)
     :from 'countries
     :where (:and (:> 'countries.name '$1)
                  (:< 'countries.name '$2)))
    'country)
   "D" "F")

  (("Denmark" 56 10) ("Dominican Republic" 19 -352/5) ("EU" 999 999)
                     ("East Timor" -17/2 2511/20)
                     ("Ecuador" -2 -773/10) ("Egypt" 27 30)  ("El Salvador" 27/2 -1771/20) ("Estonia" 59 26) ("Ethiopia" 8 38))
#+end_src

