doc/s-sql-c.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2023-12-12 Tue 18:35 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>S-SQL Examples C</title>
<meta name="author" content="Sabra Crolleton" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css" />
</head>
<body>
<div id="content" class="content">
<header>
<h1 class="title">S-SQL Examples C</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgfd9c23b">S-SQL Examples Home Page</a></li>
<li><a href="#call">Call</a></li>
<li><a href="#case">Case</a></li>
<li><a href="#cast">Cast</a></li>
<li><a href="#coalesce">Coalesce</a></li>
<li><a href="#constraints">Constraints Examples</a></li>
<li><a href="#count">Count</a></li>
<li><a href="#create-composite-types">Create-Composite-Types</a></li>
<li><a href="#create-index">Create-Index</a>
<ul>
<li><a href="#create-index-multiple-columns">Multiple Columns</a></li>
<li><a href="#create-index-with-expression">Using Postgresql Expressions</a></li>
<li><a href="#create-index-other-methods">GIN, GIST and other non-B-tree indexes</a></li>
<li><a href="#create-index-opclasses">Indexes with opclass parameters</a>
<ul>
<li><a href="#create-index-to-tsvector">To-Tsvector</a></li>
<li><a href="#create-index-2-ary">2+-ary Operators</a></li>
</ul>
</li>
<li><a href="#create-index-storage-parameters">Indexes with storage parameters</a></li>
<li><a href="#partial-indexes">Partial Indexes with where clauses</a></li>
</ul>
</li>
<li><a href="#create-table">Create-Table</a>
<ul>
<li><a href="#table-names-parameter">Table Names Parameter</a></li>
<li><a href="#temp-tables">Temporary and Unlogged Tables</a></li>
<li><a href="#identity-columns">Using Identity Columns</a></li>
<li><a href="#arrayy-columns">Array Columns</a></li>
<li><a href="#check-constraints">Check Constraints</a></li>
<li><a href="#unique-constraints">Unique Constraints</a></li>
<li><a href="#timestamps">Timestamps with and without timezones</a></li>
<li><a href="#foreign-keys">Adding Foreign Keys</a>
<ul>
<li><a href="#foreign-keys-at-column">Defining Foreign Keys at the Column Level</a></li>
<li><a href="#foreign-keys-at-table">Defining Foreign Keys at the Table Level</a></li>
</ul>
</li>
<li><a href="#generated-columns">Generated Columns</a></li>
</ul>
</li>
</ul>
</div>
</nav>

<div id="outline-container-orgfd9c23b" class="outline-2">
<h2 id="orgfd9c23b"><a href="s-sql-examples.html">S-SQL Examples Home Page</a></h2>
<div class="outline-text-2" id="text-orgfd9c23b">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left"><a href="s-sql-a.html">A</a></td>
<td class="org-left"><a href="s-sql-b.html">B</a></td>
<td class="org-left"><a href="s-sql-c.html">C</a></td>
<td class="org-left"><a href="s-sql-d.html">D</a></td>
<td class="org-left"><a href="s-sql-e.html">E</a></td>
<td class="org-left"><a href="s-sql-f.html">F</a></td>
<td class="org-left"><a href="s-sql-g.html">G</a></td>
<td class="org-left"><a href="s-sql-h.html">H</a></td>
<td class="org-left"><a href="s-sql-i.html">I</a></td>
<td class="org-left"><a href="s-sql-j.html">J</a></td>
<td class="org-left"><a href="s-sql-k.html">K</a></td>
<td class="org-left"><a href="s-sql-l.html">L</a></td>
<td class="org-left"><a href="s-sql-m.html">M</a></td>
<td class="org-left"><a href="s-sql-n.html">N</a></td>
<td class="org-left"><a href="s-sql-o.html">O</a></td>
<td class="org-left"><a href="s-sql-p.html">P</a></td>
<td class="org-left"><a href="s-sql-r.html">R</a></td>
<td class="org-left"><a href="s-sql-s.html">S</a></td>
<td class="org-left"><a href="s-sql-t.html">T</a></td>
<td class="org-left"><a href="s-sql-u.html">U</a></td>
<td class="org-left"><a href="s-sql-v.html">V</a></td>
<td class="org-left"><a href="s-sql-w.html">W</a></td>
<td class="org-left"><a href="s-sql-special-characters.html">Special Characters</a></td>
<td class="org-left"><a href="calling-postgresql-stored-functions.html">Calling Postgresql Stored Functions and Procedures</a></td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-call" class="outline-2">
<h2 id="call">Call</h2>
<div class="outline-text-2" id="text-call">
<p>
Call is used to call a Postgresql Procedure. This cannot be used in a select clause. You can pass variables to the operator.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:call</span> 'set_x_procedure 1 13))

(<span class="org-keyword">let</span> ((a 1) (b 2))
  (query (<span class="org-builtin">:call</span> 'my-proc a b 3)))

(<span class="org-keyword">let</span> ((a 1) (b 2) (p 'my-proc))
  (query (<span class="org-builtin">:call</span> p a b 3)))
</pre>
</div>
</div>
</div>
<div id="outline-container-case" class="outline-2">
<h2 id="case">Case</h2>
<div class="outline-text-2" id="text-case">
<p>
As you know, case is a conditional expression that you can use to either search for rows in a table when a condition is true or compare a table field to a statement in the case expression. So consider the following where you only look at the first 10 rows in the countries table. The Case expression indicates that if the id is less than five, return the word "Low" and if the id is greater than five, return the word "high". Notice what happens when Denmark, with an id of exactly five, gets returned.
</p>
<div class="org-src-container">
<pre class="src src-lisp">  (query (<span class="org-builtin">:select</span> 'id 'name
                (<span class="org-builtin">:case</span>
                 ((<span class="org-builtin">:&lt;</span> 'id 5) <span class="org-string">"Low"</span>)
                 ((<span class="org-builtin">:&gt;</span> 'id 5) <span class="org-string">"High"</span>))
                <span class="org-builtin">:from</span> 'countries
                <span class="org-builtin">:where</span> (<span class="org-builtin">:&lt;</span> 'id 10))))

((1 <span class="org-string">"Austria"</span> <span class="org-string">"Low"</span>) (2 <span class="org-string">"Belgium"</span> <span class="org-string">"Low"</span>) (4 <span class="org-string">"Canada"</span> <span class="org-string">"Low"</span>) (5 <span class="org-string">"Denmark"</span> <span class="org-builtin">:NULL</span>)
 (8 <span class="org-string">"France"</span> <span class="org-string">"High"</span>) (9 <span class="org-string">"Germany"</span> <span class="org-string">"High"</span>) (7 <span class="org-string">"Finland"</span> <span class="org-string">"High"</span>))

</pre>
</div>
</div>
</div>

<div id="outline-container-cast" class="outline-2">
<h2 id="cast">Cast</h2>
<div class="outline-text-2" id="text-cast">
<p>
There are two ways to cast in postmodern. First is the explicit use of cast as in:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:select</span> (<span class="org-builtin">:cast</span> (<span class="org-builtin">:as</span> <span class="org-string">"2018-04-19"</span> 'date)) <span class="org-builtin">:from</span> 'roadmap))
</pre>
</div>

<p>
Then there is the use of the type operator which effectively translates into postgresql's :: casting shortcut.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:select</span> (<span class="org-builtin">:type</span> <span class="org-string">"2018-04-19"</span> date) <span class="org-builtin">:from</span> 'roadmap))
</pre>
</div>

<p>
Note that the targetted data type is quoted in the explicit use of cast and not quoted when using type.
</p>
</div>
</div>

<div id="outline-container-coalesce" class="outline-2">
<h2 id="coalesce">Coalesce</h2>
<div class="outline-text-2" id="text-coalesce">
<p>
The COALESCE function in SQL returns the first non-NULL expression among its arguments.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query
 (<span class="org-builtin">:order-by</span>
  (<span class="org-builtin">:select</span> (<span class="org-builtin">:as</span> 'countries.name  'country)
           (<span class="org-builtin">:as</span> (<span class="org-builtin">:coalesce</span> 'countries.latitude  999)
                'latitude)
           (<span class="org-builtin">:as</span> (<span class="org-builtin">:coalesce</span> 'countries.longitude 999)
                'longitude)
   <span class="org-builtin">:from</span> 'countries
   <span class="org-builtin">:where</span> (<span class="org-builtin">:and</span> (<span class="org-builtin">:&gt;</span> 'countries.name '$1)
                (<span class="org-builtin">:&lt;</span> 'countries.name '$2)))
  'country)
 <span class="org-string">"D"</span> <span class="org-string">"F"</span>)

((<span class="org-string">"Denmark"</span> 56 10) (<span class="org-string">"Dominican Republic"</span> 19 -352/5) (<span class="org-string">"EU"</span> 999 999)
                   (<span class="org-string">"East Timor"</span> -17/2 2511/20)
                   (<span class="org-string">"Ecuador"</span> -2 -773/10) (<span class="org-string">"Egypt"</span> 27 30)  (<span class="org-string">"El Salvador"</span> 27/2 -1771/20) (<span class="org-string">"Estonia"</span> 59 26) (<span class="org-string">"Ethiopia"</span> 8 38))
</pre>
</div>
</div>
</div>
