doc/s-sql-c.org
* Constraints Examples
  :PROPERTIES:
  :CUSTOM_ID: constraints
  :END:
Suppose you want to find the constraints on a particular table. You try something like this:
#+begin_src lisp
  (query (:select '*
                :from 'information-schema.table-constraints
                :where (:= 'table-name "countries")))

(("mydatabase" "public" "countries_pkey" "mydatabase" "public" "countries" "PRIMARY KEY" "NO" "NO")

 ("mydatabase" "public" "country_name_uk" "mydatabase" "public" "countries" "UNIQUE" "NO" "NO")

 ("mydatabase" "public" "country_name_unique" "mydatabase" "public" "countries" "UNIQUE" "NO" "NO")

 ("mydatabase" "public" "2200_456618_1_not_null" "mydatabase" "public" "countries" "CHECK" "NO" "NO"))

#+end_src

Okay. That looks like it works. At a minimum, it is telling me that the countries table has a primary key named "countries_pkey". Also, for some strange reason, it has two unique constraints named "country_name_uk" and "country_name_unique".

However consider table names with multiple words separated by underscores. If you are used to postmodern turning everything nicely into hyphens, you might try something like:
#+begin_src lisp
  (query (:select '* :from 'information-schema.table-constraints
                   :where (:= 'table-name "countries-hyphenated-for-some-reason")))

#+end_src

That will not work. Remember that you have to provide the actual string name of the table. Because sql does not like hyphens and demands underscores, the correct query in postmodern would look like this:
#+begin_src lisp
  (query (:select '* :from 'information-schema.table-constraints
          :where (:= 'table-name "countries_hyphenated_for_some_reason")))

#+end_src

Or you could use s-sql:to-sql-name like this:
#+begin_src lisp
  (query (:select '*
                :from 'information-schema.table-constraints
                :where (:= 'table-name '$1))
       (s-sql:to-sql-name 'tasks-lists))

#+end_src

The query in this function generates information on the foreign key constraints in a database. Ignoring all the postgresql internal table names, while this looks complicated, the only additional items really here are :[] as the op for getting an array index, :generate-series, and :array-upper
#+begin_src lisp
  (defun describe-foreign-key-constraints ()
    "Generates a list of lists of information on the foreign key constraints"
    (query (:order-by (:select 'conname
                               (:as 'conrelid 'table)
                               (:as 'pgc.relname 'tabname)
                               (:as 'a.attname 'columns)
                               (:as 'confrelid 'foreign-table)
                               (:as 'pgf.relname 'ftabname)
                               (:as 'af.attname 'fcolumn)
                               :from
                               (:as 'pg_attribute 'af)
                               (:as 'pg_attribute 'a)
                               (:as 'pg_class 'pgc)
                               (:as 'pg_class 'pgf)
                               (:as
                                (:select 'conname 'conrelid 'confrelid
                                         (:as (:[] 'conkey 'i) 'conkey)
                                         (:as (:[] 'confkey 'i) 'confkey)
                                         :from (:as (:select 'conname
                                                             'conrelid 'confrelid
                                                             'conkey 'confkey
                                                             (:as
                                                              (:generate-series '1
                                                               :array-upper 'conkey 1))
                                                             'i)
                                                :from 'pg_constraint
                                                :where (:= 'contype "f" ))
                                         'ss))
                               'ss2)
            :where (:and (:= 'af.attnum 'confkey)
                         (:= 'af.attrelid 'confrelid)
                         (:= 'a.attnum 'conkey)
                         (:= 'a.attrelid 'conrelid)
                         (:= 'pgf.relfilenode 'confrelid)
                         (:= 'pgc.relfilenode 'conrelid)))
           'ftabname 'fcolumn 'tabname 'columns))

#+end_src

* Count
  :PROPERTIES:
  :CUSTOM_ID: count
  :END:
The simplest use of count looks like this:
#+begin_src lisp
  (query (:select (:count '*) :from 'countries) :single)

202
#+end_src

* Create-Composite-Types
  :PROPERTIES:
  :CUSTOM_ID: create-composite-types
  :END:
[[https://www.postgresql.org/docs/current/rowtypes.html][Composite types]] can be created with the :create-composite-type operator. For example:
#+begin_src lisp
  (query (:create-composite-type 'inventory-item
                                 (name string)
                                 (df double-float)
                                 (count bigint)))

  (query (:create-composite-type 'employee-type (name text) (salary numeric)))
#+end_src
Those types can then be used in :create-table queries.
#+begin_src lisp
      (query (:create-table 'distributors
                            ((i :type inventory-item)
                             (e  :type employee-type))))
#+end_src

* Create-Index
  :PROPERTIES:
  :CUSTOM_ID: create-index
  :END:
  ** Basic
    :PROPERTIES:
  :CUSTOM_ID: create-index-basic
  :END:
To create a B-tree index on the column title in the table films.
#+begin_src lisp
  (query (:create-index 'films_idx :on "films" :fields 'title))
#+end_src
