doc/s-sql-c.html

<div id="outline-container-constraints" class="outline-2">
<h2 id="constraints">Constraints Examples</h2>
<div class="outline-text-2" id="text-constraints">
<p>
Suppose you want to find the constraints on a particular table. You try something like this:
</p>
<div class="org-src-container">
<pre class="src src-lisp">  (query (<span class="org-builtin">:select</span> '*
                <span class="org-builtin">:from</span> 'information-schema.table-constraints
                <span class="org-builtin">:where</span> (<span class="org-builtin">:=</span> 'table-name <span class="org-string">"countries"</span>)))

((<span class="org-string">"mydatabase"</span> <span class="org-string">"public"</span> <span class="org-string">"countries_pkey"</span> <span class="org-string">"mydatabase"</span> <span class="org-string">"public"</span> <span class="org-string">"countries"</span> <span class="org-string">"PRIMARY KEY"</span> <span class="org-string">"NO"</span> <span class="org-string">"NO"</span>)

 (<span class="org-string">"mydatabase"</span> <span class="org-string">"public"</span> <span class="org-string">"country_name_uk"</span> <span class="org-string">"mydatabase"</span> <span class="org-string">"public"</span> <span class="org-string">"countries"</span> <span class="org-string">"UNIQUE"</span> <span class="org-string">"NO"</span> <span class="org-string">"NO"</span>)

 (<span class="org-string">"mydatabase"</span> <span class="org-string">"public"</span> <span class="org-string">"country_name_unique"</span> <span class="org-string">"mydatabase"</span> <span class="org-string">"public"</span> <span class="org-string">"countries"</span> <span class="org-string">"UNIQUE"</span> <span class="org-string">"NO"</span> <span class="org-string">"NO"</span>)

 (<span class="org-string">"mydatabase"</span> <span class="org-string">"public"</span> <span class="org-string">"2200_456618_1_not_null"</span> <span class="org-string">"mydatabase"</span> <span class="org-string">"public"</span> <span class="org-string">"countries"</span> <span class="org-string">"CHECK"</span> <span class="org-string">"NO"</span> <span class="org-string">"NO"</span>))

</pre>
</div>

<p>
Okay. That looks like it works. At a minimum, it is telling me that the countries table has a primary key named "countries_pkey". Also, for some strange reason, it has two unique constraints named "country_name_uk" and "country_name_unique".
</p>

<p>
However consider table names with multiple words separated by underscores. If you are used to postmodern turning everything nicely into hyphens, you might try something like:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:select</span> '* <span class="org-builtin">:from</span> 'information-schema.table-constraints
                 <span class="org-builtin">:where</span> (<span class="org-builtin">:=</span> 'table-name <span class="org-string">"countries-hyphenated-for-some-reason"</span>)))

</pre>
</div>

<p>
That will not work. Remember that you have to provide the actual string name of the table. Because sql does not like hyphens and demands underscores, the correct query in postmodern would look like this:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:select</span> '* <span class="org-builtin">:from</span> 'information-schema.table-constraints
        <span class="org-builtin">:where</span> (<span class="org-builtin">:=</span> 'table-name <span class="org-string">"countries_hyphenated_for_some_reason"</span>)))

</pre>
</div>

<p>
Or you could use s-sql:to-sql-name like this:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:select</span> '*
              <span class="org-builtin">:from</span> 'information-schema.table-constraints
              <span class="org-builtin">:where</span> (<span class="org-builtin">:=</span> 'table-name '$1))
     (s-sql:to-sql-name 'tasks-lists))

</pre>
</div>

<p>
The query in this function generates information on the foreign key constraints in a database. Ignoring all the postgresql internal table names, while this looks complicated, the only additional items really here are :[] as the op for getting an array index, :generate-series, and :array-upper
</p>
<div class="org-src-container">
<pre class="src src-lisp">(<span class="org-keyword">defun</span> <span class="org-function-name">describe-foreign-key-constraints</span> ()
  <span class="org-doc">"Generates a list of lists of information on the foreign key constraints"</span>
  (query (<span class="org-builtin">:order-by</span> (<span class="org-builtin">:select</span> 'conname
                             (<span class="org-builtin">:as</span> 'conrelid 'table)
                             (<span class="org-builtin">:as</span> 'pgc.relname 'tabname)
                             (<span class="org-builtin">:as</span> 'a.attname 'columns)
                             (<span class="org-builtin">:as</span> 'confrelid 'foreign-table)
                             (<span class="org-builtin">:as</span> 'pgf.relname 'ftabname)
                             (<span class="org-builtin">:as</span> 'af.attname 'fcolumn)
                             <span class="org-builtin">:from</span>
                             (<span class="org-builtin">:as</span> 'pg_attribute 'af)
                             (<span class="org-builtin">:as</span> 'pg_attribute 'a)
                             (<span class="org-builtin">:as</span> 'pg_class 'pgc)
                             (<span class="org-builtin">:as</span> 'pg_class 'pgf)
                             (<span class="org-builtin">:as</span>
                              (<span class="org-builtin">:select</span> 'conname 'conrelid 'confrelid
                                       (<span class="org-builtin">:as</span> (<span class="org-builtin">:[]</span> 'conkey 'i) 'conkey)
                                       (<span class="org-builtin">:as</span> (<span class="org-builtin">:[]</span> 'confkey 'i) 'confkey)
                                       <span class="org-builtin">:from</span> (<span class="org-builtin">:as</span> (<span class="org-builtin">:select</span> 'conname
                                                           'conrelid 'confrelid
                                                           'conkey 'confkey
                                                           (<span class="org-builtin">:as</span>
                                                            (<span class="org-builtin">:generate-series</span> '1
                                                             <span class="org-builtin">:array-upper</span> 'conkey 1))
                                                           'i)
                                              <span class="org-builtin">:from</span> 'pg_constraint
                                              <span class="org-builtin">:where</span> (<span class="org-builtin">:=</span> 'contype <span class="org-string">"f"</span> ))
                                       'ss))
                             'ss2)
          <span class="org-builtin">:where</span> (<span class="org-builtin">:and</span> (<span class="org-builtin">:=</span> 'af.attnum 'confkey)
                       (<span class="org-builtin">:=</span> 'af.attrelid 'confrelid)
                       (<span class="org-builtin">:=</span> 'a.attnum 'conkey)
                       (<span class="org-builtin">:=</span> 'a.attrelid 'conrelid)
                       (<span class="org-builtin">:=</span> 'pgf.relfilenode 'confrelid)
                       (<span class="org-builtin">:=</span> 'pgc.relfilenode 'conrelid)))
         'ftabname 'fcolumn 'tabname 'columns))

</pre>
</div>
</div>
</div>

<div id="outline-container-count" class="outline-2">
<h2 id="count">Count</h2>
<div class="outline-text-2" id="text-count">
<p>
The simplest use of count looks like this:
</p>
<div class="org-src-container">
<pre class="src src-lisp">  (query (<span class="org-builtin">:select</span> (<span class="org-builtin">:count</span> '*) <span class="org-builtin">:from</span> 'countries) <span class="org-builtin">:single</span>)

202
</pre>
</div>
</div>
</div>

<div id="outline-container-create-composite-types" class="outline-2">
<h2 id="create-composite-types">Create-Composite-Types</h2>
<div class="outline-text-2" id="text-create-composite-types">
<p>
<a href="https://www.postgresql.org/docs/current/rowtypes.html">Composite types</a> can be created with the :create-composite-type operator. For example:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:create-composite-type</span> 'inventory-item
                               (name string)
                               (df double-float)
                               (count bigint)))

(query (<span class="org-builtin">:create-composite-type</span> 'employee-type (name text) (salary numeric)))
</pre>
</div>
<p>
Those types can then be used in :create-table queries.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:create-table</span> 'distributors
                      ((i <span class="org-builtin">:type</span> inventory-item)
                       (e  <span class="org-builtin">:type</span> employee-type))))
</pre>
</div>
</div>
</div>

<div id="outline-container-create-index" class="outline-2">
<h2 id="create-index">Create-Index</h2>
<div class="outline-text-2" id="text-create-index">
<p>
** Basic
</p>
<p>
:CUSTOM_ID: create-index-basic
</p>
<p>
To create a B-tree index on the column title in the table films.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:create-index</span> 'films_idx <span class="org-builtin">:on</span> <span class="org-string">"films"</span> <span class="org-builtin">:fields</span> 'title))
</pre>
</div>
</div>
