doc/s-sql-c.org
** Multiple Columns
  :PROPERTIES:
  :CUSTOM_ID: create-index-multiple-columns
  :END:
Multiple-column indexes:
#+begin_src lisp
  (query (:create-index 'films-idx :on "films" :fields 'title 'id))
#+end_src
** Using Postgresql Expressions
  :PROPERTIES:
  :CUSTOM_ID: create-index-with-expression
  :END:
To create an index on the postgresql expression lower so as to generate efficient case insensitive searches
#+begin_src lisp
  (query (:create-index 'films_idx :on "films" :fields (:lower 'title)))
#+end_src
** GIN, GIST and other non-B-tree indexes
  :PROPERTIES:
  :CUSTOM_ID: create-index-other-methods
  :END:
To create an index using e.g. GIN instead of a B-tree index, you need to provide a :using clause:
#+begin_src lisp
  (query (:create-index 'films_idx :on "films" :using 'gin :fields 'title))
#+end_src

** Indexes with opclass parameters
  :PROPERTIES:
  :CUSTOM_ID: create-index-opclasses
  :END:
The following basic opclass parameters are supported:
:asc, :desc, :nulls-first, :null-last, :nulls-distinct, :nulls-not-distinct, :array-ops, jsonb-ops, :jsonb-path-ops, :gin-trgm-ops, :tsvector-ops.

To specify using an opclass parameter, you will need to enclose the specific field in its own form and use a keyword parameter. The second example shows a second field included in the index, but without an opclass parameter, so it does not need to be in its own form (although it can be):
#+begin_src lisp
  (query (:create-index 'items-idx :on 'test-items :using 'gin
                   :fields (:jsonb-path-ops 'metadata)))

  (query (:create-index 'films-idx :on 'films :using 'gin
          :fields (:nulls-first 'customer-id ) 'order-date))

  (query (:create-index 'films-idx :on 'films :using 'gin
          :fields (:nulls-first 'customer-id ) (:asc 'order-date)))
#+end_src
*** To-Tsvector
  :PROPERTIES:
  :CUSTOM_ID: create-index-to-tsvector
  :END:
  to-tsvector is a bit of a special case:
  #+begin_src lisp
    (query (:create-index 'pgweb-idx :on 'pgweb :using 'gin
             :fields (:to-tsvector "english" 'body)))
  #+end_src
*** 2+-ary Operators
  :PROPERTIES:
  :CUSTOM_ID: create-index-2-ary
  :END:
These operators have two operands. They need to be in their own form:
#+begin_src lisp
  (query (:create-index 'test-idx :on 'test :using 'btree
          :fields (:->> 'data "field")

  (query (:create-index 'pointloc0 :on 'points :using 'gist
          :fields (:box 'location 'location)))

  (query (:create-index 'pointloc2 :on 'points :using 'gist
          :fields (:asc (:box 'location 'location)) (:nulls-last 'name)))
#+end_src
** Indexes with storage parameters
  :PROPERTIES:
  :CUSTOM_ID: create-index-storage-parameters
  :END:
To specify storage parameters (e.g. fillfactor=70, deduplicate_items=on, fastupdate = off or similar), use a :with keyword parameter and a form containing := operators, the storage parameter and the value.
#+begin_src lisp
    (query (:create-index 'gin-idx :on 'documents-table :using gin
          :fields 'locations :with (:= 'fillfactor 70)))

  (query (:create-index 'title-index :on 'films :fields title
          :with (:= 'deduplicate-items 'off)))
#+end_src
With multiple storage parameters:
#+begin_src lisp
  (query (:create-index 'gin-idx :on 'documents-table :using gin
          :fields 'locations :with (:= 'deduplicate-items off) (:= 'fillfactor 70)))
#+end_src

** Partial Indexes with where clauses
  :PROPERTIES:
  :CUSTOM_ID: partial-indexes
  :END:
  An example of a partial index:
#+begin_src lisp
  (query (:create-index 'orders_unbilled_idx :on 'orders :fields 'order-nr
                   :where (:and (:is-not-true 'billed)
                                (:< 'order_nr 1000)))))
#+end_src

