doc/s-sql-c.html
<div id="outline-container-create-index-multiple-columns" class="outline-3">
<h3 id="create-index-multiple-columns">Multiple Columns</h3>
<div class="outline-text-3" id="text-create-index-multiple-columns">
<p>
Multiple-column indexes:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:create-index</span> 'films-idx <span class="org-builtin">:on</span> <span class="org-string">"films"</span> <span class="org-builtin">:fields</span> 'title 'id))
</pre>
</div>
</div>
</div>
<div id="outline-container-create-index-with-expression" class="outline-3">
<h3 id="create-index-with-expression">Using Postgresql Expressions</h3>
<div class="outline-text-3" id="text-create-index-with-expression">
<p>
To create an index on the postgresql expression lower so as to generate efficient case insensitive searches
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:create-index</span> 'films_idx <span class="org-builtin">:on</span> <span class="org-string">"films"</span> <span class="org-builtin">:fields</span> (<span class="org-builtin">:lower</span> 'title)))
</pre>
</div>
</div>
</div>
<div id="outline-container-create-index-other-methods" class="outline-3">
<h3 id="create-index-other-methods">GIN, GIST and other non-B-tree indexes</h3>
<div class="outline-text-3" id="text-create-index-other-methods">
<p>
To create an index using e.g. GIN instead of a B-tree index, you need to provide a :using clause:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:create-index</span> 'films_idx <span class="org-builtin">:on</span> <span class="org-string">"films"</span> <span class="org-builtin">:using</span> 'gin <span class="org-builtin">:fields</span> 'title))
</pre>
</div>
</div>
</div>

<div id="outline-container-create-index-opclasses" class="outline-3">
<h3 id="create-index-opclasses">Indexes with opclass parameters</h3>
<div class="outline-text-3" id="text-create-index-opclasses">
<p>
The following basic opclass parameters are supported:
:asc, :desc, :nulls-first, :null-last, :nulls-distinct, :nulls-not-distinct, :array-ops, jsonb-ops, :jsonb-path-ops, :gin-trgm-ops, :tsvector-ops.
</p>

<p>
To specify using an opclass parameter, you will need to enclose the specific field in its own form and use a keyword parameter. The second example shows a second field included in the index, but without an opclass parameter, so it does not need to be in its own form (although it can be):
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:create-index</span> 'items-idx <span class="org-builtin">:on</span> 'test-items <span class="org-builtin">:using</span> 'gin
                 <span class="org-builtin">:fields</span> (<span class="org-builtin">:jsonb-path-ops</span> 'metadata)))

(query (<span class="org-builtin">:create-index</span> 'films-idx <span class="org-builtin">:on</span> 'films <span class="org-builtin">:using</span> 'gin
        <span class="org-builtin">:fields</span> (<span class="org-builtin">:nulls-first</span> 'customer-id ) 'order-date))

(query (<span class="org-builtin">:create-index</span> 'films-idx <span class="org-builtin">:on</span> 'films <span class="org-builtin">:using</span> 'gin
        <span class="org-builtin">:fields</span> (<span class="org-builtin">:nulls-first</span> 'customer-id ) (<span class="org-builtin">:asc</span> 'order-date)))
</pre>
</div>
</div>
<div id="outline-container-create-index-to-tsvector" class="outline-4">
<h4 id="create-index-to-tsvector">To-Tsvector</h4>
<div class="outline-text-4" id="text-create-index-to-tsvector">
<p>
to-tsvector is a bit of a special case:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:create-index</span> 'pgweb-idx <span class="org-builtin">:on</span> 'pgweb <span class="org-builtin">:using</span> 'gin
         <span class="org-builtin">:fields</span> (<span class="org-builtin">:to-tsvector</span> <span class="org-string">"english"</span> 'body)))
</pre>
</div>
</div>
</div>
<div id="outline-container-create-index-2-ary" class="outline-4">
<h4 id="create-index-2-ary">2+-ary Operators</h4>
<div class="outline-text-4" id="text-create-index-2-ary">
<p>
These operators have two operands. They need to be in their own form:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:create-index</span> 'test-idx <span class="org-builtin">:on</span> 'test <span class="org-builtin">:using</span> 'btree
        <span class="org-builtin">:fields</span> (<span class="org-builtin">:-&gt;&gt;</span> 'data <span class="org-string">"field"</span>)

(query (<span class="org-builtin">:create-index</span> 'pointloc0 <span class="org-builtin">:on</span> 'points <span class="org-builtin">:using</span> 'gist
        <span class="org-builtin">:fields</span> (<span class="org-builtin">:box</span> 'location 'location)))

(query (<span class="org-builtin">:create-index</span> 'pointloc2 <span class="org-builtin">:on</span> 'points <span class="org-builtin">:using</span> 'gist
        <span class="org-builtin">:fields</span> (<span class="org-builtin">:asc</span> (<span class="org-builtin">:box</span> 'location 'location)) (<span class="org-builtin">:nulls-last</span> 'name)))
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-create-index-storage-parameters" class="outline-3">
<h3 id="create-index-storage-parameters">Indexes with storage parameters</h3>
<div class="outline-text-3" id="text-create-index-storage-parameters">
<p>
To specify storage parameters (e.g. fillfactor=70, deduplicate_items=on, fastupdate = off or similar), use a :with keyword parameter and a form containing := operators, the storage parameter and the value.
</p>
<div class="org-src-container">
<pre class="src src-lisp">  (query (<span class="org-builtin">:create-index</span> 'gin-idx <span class="org-builtin">:on</span> 'documents-table <span class="org-builtin">:using</span> gin
        <span class="org-builtin">:fields</span> 'locations <span class="org-builtin">:with</span> (<span class="org-builtin">:=</span> 'fillfactor 70)))

(query (<span class="org-builtin">:create-index</span> 'title-index <span class="org-builtin">:on</span> 'films <span class="org-builtin">:fields</span> title
        <span class="org-builtin">:with</span> (<span class="org-builtin">:=</span> 'deduplicate-items 'off)))
</pre>
</div>
<p>
With multiple storage parameters:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:create-index</span> 'gin-idx <span class="org-builtin">:on</span> 'documents-table <span class="org-builtin">:using</span> gin
        <span class="org-builtin">:fields</span> 'locations <span class="org-builtin">:with</span> (<span class="org-builtin">:=</span> 'deduplicate-items off) (<span class="org-builtin">:=</span> 'fillfactor 70)))
</pre>
</div>
</div>
</div>

<div id="outline-container-partial-indexes" class="outline-3">
<h3 id="partial-indexes">Partial Indexes with where clauses</h3>
<div class="outline-text-3" id="text-partial-indexes">
<p>
An example of a partial index:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:create-index</span> 'orders_unbilled_idx <span class="org-builtin">:on</span> 'orders <span class="org-builtin">:fields</span> 'order-nr
                 <span class="org-builtin">:where</span> (<span class="org-builtin">:and</span> (<span class="org-builtin">:is-not-true</span> 'billed)
                              (<span class="org-builtin">:&lt;</span> 'order_nr 1000)))))
</pre>
</div>
</div>
</div>
</div>
