doc/s-sql-c.html

<div id="outline-container-create-table" class="outline-2">
<h2 id="create-table">Create-Table</h2>
<div class="outline-text-2" id="text-create-table">
<p>
Here we are talking about the S-SQL operator :create-table, not the create-table function name in Postmodern. First, starting at a minimum level, the :create-table and :create-extended-table operator calls are exactly the same. Let's walk through a simple example:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:create-table</span> 'films-at-eleven
    ((code <span class="org-builtin">:type</span> (or (string 5) db-null) <span class="org-builtin">:constraint</span> 'firstkey
           <span class="org-builtin">:primary-key</span> t)
      (title <span class="org-builtin">:type</span> (varchar 40))
      (did <span class="org-builtin">:type</span> integer)
      (date-prod <span class="org-builtin">:type</span> (or date db-null))
      (kind <span class="org-builtin">:type</span> (or (varchar 10) db-null))
      (len <span class="org-builtin">:type</span> (or interval db-null) <span class="org-builtin">:interval</span> <span class="org-builtin">:hour-to-minute</span>))))

</pre>
</div>

<p>
The parameter specification is :create-table (name (&amp;rest columns) &amp;rest options)
</p>

<p>
The first parameter is the name of the new table. You could make the name a quoted string, e.g. "films-at-eleven", but postmodern will handle either a string or the unquoted parameter provided above. Postmodern will also automatically handle the conversion of the hyphens so beloved by common lisp programmers to the underscores demanded by the sql specification.
</p>

<p>
The next form contains subforms for each column in the table.
</p>

<p>
The first parameter being the name of the column.
</p>

<p>
As you know, postgresql will enforce the data type for the column. So, the next keyword specifies that type to follow. You can see several different types specified in this table. Look at the type for 'code'. It specifies that the data will be either NULL or a string with a maximum length of 5 characters.
</p>

<p>
Compare that against the type specifiers for title or did. In both of those cases, the column entry is not allowed to be NULL, it must have a value. In this example the title must be a string with a length no greater than 40 characters. (For most purposes, you can treat a string specification the same as a varchar specification.
</p>

<p>
The did type specification mandates an integer - trying to put a float in that column will trigger a database type error.
</p>

<p>
The date-prod column obviously has a date data type and the len column has a interval data type, intervals being a period of time rather than a specific time.
</p>

<p>
The code column also has a constraint - It is the primary key for indexing the table and that contraint has a name - in this case 'firstkey. If you do not name the constraint, the system will name it for you.
</p>

<p>
The len column also has additional information. It is an interval of time; That could encompass years as well as seconds. The specification given here, :hour-to-minute means that the database will only keep the hours to minutes part of the potential time interval.
</p>
</div>

<div id="outline-container-table-names-parameter" class="outline-3">
<h3 id="table-names-parameter">Table Names Parameter</h3>
<div class="outline-text-3" id="text-table-names-parameter">
<p>
The following discussion on table names is the same for both :create-table or :create-extended table.
</p>

<p>
Create-table works with either the simple name for the table parameter or the name can be wrapped in a form. There are a few acceptable ways to pass the table-name parameters. We recommend a single quote as in the first example below, but for backwards compatibility, you can also provide the table-name with no quotes at all. The last example below shows the table name preceded by the desired schema name. e.g. 'public.tablename1.
</p>
<div class="org-src-container">
<pre class="src src-lisp">
(query (<span class="org-builtin">:create-table</span> 'distributors-in-hell
                      ((did <span class="org-builtin">:type</span> (or integer db-null)))))

(query (<span class="org-builtin">:create-table</span> (distributors-in-hell)
                      ((did <span class="org-builtin">:type</span> (or integer db-null)))))

(query (<span class="org-builtin">:create-table</span> (<span class="org-string">"distributors-in-hell"</span>)
                      ((did <span class="org-builtin">:type</span> (or integer db-null)))))

(query (<span class="org-builtin">:create-table</span> 'public.distributors-in-hell
                      ((did <span class="org-builtin">:type</span> (or integer db-null)))))

</pre>
</div>
<p>
Using the name wrapped in a form provides the opportunity to add additional qualifiers - if-not-exists, temp, and unlogged.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:create-table</span> (<span class="org-builtin">:if-not-exists</span> 'distributors-in-hell)

                      ((did <span class="org-builtin">:type</span> (or integer db-null)))))
</pre>
</div>
</div>
</div>

<div id="outline-container-temp-tables" class="outline-3">
<h3 id="temp-tables">Temporary and Unlogged Tables</h3>
<div class="outline-text-3" id="text-temp-tables">
<p>
Temporary tables exists only for the duration of the session. To create them using s-sql in postmodern, the first parameter to :create-table should be a form where the first atom in the form is the keyword :temp. You can optionally use the :if-not-exists keyword, and then the name of the temporary table. E.g.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:create-table</span> (<span class="org-builtin">:temp</span> 'distributors-in-hell)
                      ((did <span class="org-builtin">:type</span> (or integer db-null)))))

(query (<span class="org-builtin">:create-table</span> (<span class="org-builtin">:temp</span> <span class="org-builtin">:if-not-exists</span> 'distributors-in-hell)
                     ((did <span class="org-builtin">:type</span> (or integer db-null)))))

</pre>
</div>

<p>
Unlogged tables do not have their data written to the write-ahead log. As a result they are faster, but not crash safe. Any indexes created on an unlogged table are unlogged as well. The parameter signature is similar to a temporary table. E.g.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:create-table</span> (<span class="org-builtin">:unlogged</span> 'distributors-in-hell)
                      ((did <span class="org-builtin">:type</span> (or integer db-null)))))
</pre>
</div>
</div>
</div>
