doc/s-sql-c.html

<div id="outline-container-identity-columns" class="outline-3">
<h3 id="identity-columns">Using Identity Columns</h3>
<div class="outline-text-3" id="text-identity-columns">
<p>
Postgresql version 10 added identity columns. These are auto-incrementing columns that use the standard SQL syntax instead of the serial and bigserial datatypes which are still available, but are not SQL standard syntax. The serial and bigserial datatypes also generate sequences that may have different usage permissions which can be problematic if you need to make changes to the sequence.
</p>

<p>
There are two keyword alternatives that need to be considered:
</p>

<ul class="org-ul">
<li>:generated-as-identity-by-default (or more simply :identity-by-default)</li>
<li>:generated-as-identity-always (or more simply :identity-always)</li>
</ul>

<p>
The difference between the two alternatives is that if you try to insert or update a value in the column and the generated-always option is chosen, postgresql will raise an error. If you use the by-default option, postgresql will use your value rather than the automatically generated value.
</p>

<p>
Note: The data type used for identity columns must be one of smallint, int, integer or bigint.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:create-table</span> 'color
                      ((color-id <span class="org-builtin">:type</span> int <span class="org-builtin">:generated-as-identity-always</span> t)
                       (color-name <span class="org-builtin">:type</span> varchar))))

(query (<span class="org-builtin">:create-table</span> 'color
                      ((color-id <span class="org-builtin">:type</span> int <span class="org-builtin">:generated-as-identity-by-default</span> t)
                       (color-name <span class="org-builtin">:type</span> varchar))))

(query (<span class="org-builtin">:create-table</span> 'color
                      ((color-id <span class="org-builtin">:type</span> int <span class="org-builtin">:identity-always</span> t)
                       (color-name <span class="org-builtin">:type</span> varchar))))

(query (<span class="org-builtin">:create-table</span> 'color
                      ((color-id <span class="org-builtin">:type</span> int <span class="org-builtin">:identity-by-default</span> t)
                       (color-name <span class="org-builtin">:type</span> varchar))))

</pre>
</div>
</div>
</div>

<div id="outline-container-arrayy-columns" class="outline-3">
<h3 id="arrayy-columns">Array Columns</h3>
<div class="outline-text-3" id="text-arrayy-columns">
<p>
The following shows the creation of a table with a two dimensional array
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:create-table</span> 'array-int
                      ((vector <span class="org-builtin">:type</span> (or int[][] db-null)))))
</pre>
</div>
</div>
</div>

<div id="outline-container-check-constraints" class="outline-3">
<h3 id="check-constraints">Check Constraints</h3>
<div class="outline-text-3" id="text-check-constraints">
<p>
You can put a contraint on a table row that specifies values must meet certain requirements. In the following examples, the first puts a check constraint on a row, the second places at check constraint at the table level.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:create-table</span> 'distributors
                      ((did <span class="org-builtin">:type</span> (or integer db-null) <span class="org-builtin">:check</span> (<span class="org-builtin">:&gt;</span> 'did 100))
                       (name <span class="org-builtin">:type</span> (or (varchar 40) db-null)))))

(query (<span class="org-builtin">:create-table</span> 'distributors
                      ((did <span class="org-builtin">:type</span> (or integer db-null))
                       (name <span class="org-builtin">:type</span> (or (varchar 40) db-null)))
                      (<span class="org-builtin">:constraint</span> con1
                       <span class="org-builtin">:check</span> (<span class="org-builtin">:and</span> (<span class="org-builtin">:&gt;</span> 'did 100)
                                    (<span class="org-builtin">:&lt;&gt;</span> 'name <span class="org-string">""</span>)))))

</pre>
</div>
</div>
</div>


<div id="outline-container-unique-constraints" class="outline-3">
<h3 id="unique-constraints">Unique Constraints</h3>
<div class="outline-text-3" id="text-unique-constraints">
<p>
You can ensure that a column or a combination of columns is unique without making that column or columns the primary key for the table.
</p>

<p>
The first example sets a unique constraint at the column level of email, the second example sets a unique constraint at the table level.
</p>

<p>
Please note the need to set :unique to t in the column constraint version.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:create-table</span> 'person
                      ((id <span class="org-builtin">:type</span> serial <span class="org-builtin">:primary-key</span> t)
                       (first-name <span class="org-builtin">:type</span> (varchar 50))
                       (last-name <span class="org-builtin">:type</span> (varchar 50))
                       (email <span class="org-builtin">:type</span> (varchar 50) <span class="org-builtin">:unique</span> t))))

(query (<span class="org-builtin">:create-table</span> 'films
                      ((code <span class="org-builtin">:type</span> (or (string 5) db-null))
                       (title <span class="org-builtin">:type</span> (or (varchar 40) db-null))
                       (did <span class="org-builtin">:type</span> (or integer db-null))
                       (date-prod <span class="org-builtin">:type</span> (or date db-null))
                       (kind <span class="org-builtin">:type</span> (or (varchar 10) db-null))
                       (len <span class="org-builtin">:type</span> (or interval db-null) <span class="org-builtin">:interval</span> <span class="org-builtin">:hour-to-minute</span>))
                      (<span class="org-builtin">:constraint</span> production <span class="org-builtin">:unique</span> 'date-prod)))

</pre>
</div>

<p>
This can get more complex if so desired. See the following example from the postgresql documentation, translated into s-sql. This level of complexity, however, requires the :create-extended-table method.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:create-extended-table</span> 'distributors
                               ((did <span class="org-builtin">:type</span> (or integer db-null))
                                (name <span class="org-builtin">:type</span> (or (varchar 40) db-null)))
                               ((<span class="org-builtin">:unique</span> did <span class="org-builtin">:with</span> (<span class="org-builtin">:=</span> 'fillfactor 70)))))

</pre>
</div>

<p>
In case you are wondering, fillfactor is a storage parameter described in the postgresql documentation as:
</p>

<p>
"The fillfactor for a table is a percentage between 10 and 100. 100 (complete packing) is the default. When a smaller fillfactor is specified, INSERT operations pack table pages only to the indicated percentage; the remaining space on each page is reserved for updating rows on that page. This gives UPDATE a chance to place the updated copy of a row on the same page as the original, which is more efficient than placing it on a different page. For a table whose entries are never updated, complete packing is the best choice, but in heavily updated tables smaller fillfactors are appropriate. This parameter cannot be set for TOAST tables."
</p>
</div>
</div>
