doc/s-sql-c.org
** Timestamps with and without timezones
:PROPERTIES:
:CUSTOM_ID: timestamps
:END:
Ah, the bane of many programmers' existence - dates and times. At least the table creation is fairly straightforward.

The following examples are fairly self explanatory.
#+begin_src lisp
(query (:create-table 'account-role
                      ((user-id :type integer)
                       (role-id :type integer)
                       (grant-date :type (or timestamp-without-time-zone db-null)))))

(query (:create-table 'account-role
                      ((user-id :type integer)
                       (role-id :type integer)
                       (grant-date :type (or timestamp-with-time-zone db-null)))))

(query (:create-table 'account-role
                      ((user-id :type integer)
                       (role-id :type integer)
                       (grant-date :type (or timestamptz db-null)))))

(query (:create-table 'account-role
                      ((user-id :type integer)
                       (role-id :type integer)
                       (grant-date :type (or timestamp db-null)))))

(query (:create-table 'account-role
                      ((user-id :type integer)
                       (role-id :type integer)
                       (grant-date :type (or time db-null)))))

#+end_src

** Adding Foreign Keys
:PROPERTIES:
:CUSTOM_ID: foreign-keys
:END:
There are a few different ways to add foreign keys in postgresql when defining a table.

*** Defining Foreign Keys at the Column Level
:PROPERTIES:
:CUSTOM_ID: foreign-keys-at-column
:END:
First with foreign key on the column. Use the keyword :references and specify the table name and the relevant column within the subform. You will see why the subform in a minute.
#+begin_src lisp
  (query (:create-table 'so-items
                        ((item-id :type integer)
                         (so-id :type (or integer db-null)
                                :references ((so-headers id)))
                         (product-id :type (or integer db-null))
                         (qty :type (or integer db-null))
                         (net-price :type (or numeric db-null)))
                        (:primary-key item-id so-id)))

#+end_src

If the foreign key references a group of columns in the foreign table, those fit into that same subform.
#+begin_src lisp
  (query (:create-table 'so-items
                        ((item-id :type integer)
                         (so-id :type (or integer db-null)
                                :references ((so-headers id p1 p2)))
                         (product-id :type (or integer db-null))
                         (qty :type (or integer db-null))
                         (net-price :type (or numeric db-null)))
                        (:primary-key item-id so-id)))

#+end_src

You can specify the actions to be taken if a row in the foreign table is deleted or updated. Per the postgresql documentation:

"… when the data in the referenced columns is changed, certain actions are performed on the data in this table's columns. The ON DELETE clause specifies the action to perform when a referenced row in the referenced table is being deleted. Likewise, the ON UPDATE clause specifies the action to perform when a referenced column in the referenced table is being updated to a new value. If the row is updated, but the referenced column is not actually changed, no action is done. Referential actions other than the NO ACTION check cannot be deferred, even if the constraint is declared deferrable. There are the following possible actions for each clause:

        NO ACTION

Produce an error indicating that the deletion or update would create a foreign key constraint violation. If the constraint is deferred, this error will be produced at constraint check time if there still exist any referencing rows. This is the default action in postgresql but the default in postmodern is restrict.

        RESTRICT

Produce an error indicating that the deletion or update would create a foreign key constraint violation. This is the same as NO ACTION except that the check is not deferrable.

        CASCADE

Delete any rows referencing the deleted row, or update the values of the referencing column(s) to the new values of the referenced columns, respectively.

        SET NULL

Set the referencing column(s) to null.

        SET DEFAULT

Set the referencing column(s) to their default values. (There must be a row in the referenced table matching the default values, if they are not null, or the operation will fail.)

If the referenced column(s) are changed frequently, it might be wise to add an index to the referencing column(s) so that referential actions associated with the foreign key constraint can be performed more efficiently."

So now examples with specifying the on-delete and on-update actions.
#+begin_src lisp
(query (:create-table 'so-items
                      ((item-id :type integer)
                       (so-id :type (or integer db-null)
                              :references ((so-headers id) :no-action :no-action))
                       (product-id :type (or integer db-null))
                       (qty :type (or integer db-null))
                       (net-price :type (or numeric db-null)))
                      (:primary-key item-id so-id)))

#+end_src

