doc/s-sql-c.html

<div id="outline-container-timestamps" class="outline-3">
<h3 id="timestamps">Timestamps with and without timezones</h3>
<div class="outline-text-3" id="text-timestamps">
<p>
Ah, the bane of many programmers' existence - dates and times. At least the table creation is fairly straightforward.
</p>

<p>
The following examples are fairly self explanatory.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:create-table</span> 'account-role
                      ((user-id <span class="org-builtin">:type</span> integer)
                       (role-id <span class="org-builtin">:type</span> integer)
                       (grant-date <span class="org-builtin">:type</span> (or timestamp-without-time-zone db-null)))))

(query (<span class="org-builtin">:create-table</span> 'account-role
                      ((user-id <span class="org-builtin">:type</span> integer)
                       (role-id <span class="org-builtin">:type</span> integer)
                       (grant-date <span class="org-builtin">:type</span> (or timestamp-with-time-zone db-null)))))

(query (<span class="org-builtin">:create-table</span> 'account-role
                      ((user-id <span class="org-builtin">:type</span> integer)
                       (role-id <span class="org-builtin">:type</span> integer)
                       (grant-date <span class="org-builtin">:type</span> (or timestamptz db-null)))))

(query (<span class="org-builtin">:create-table</span> 'account-role
                      ((user-id <span class="org-builtin">:type</span> integer)
                       (role-id <span class="org-builtin">:type</span> integer)
                       (grant-date <span class="org-builtin">:type</span> (or timestamp db-null)))))

(query (<span class="org-builtin">:create-table</span> 'account-role
                      ((user-id <span class="org-builtin">:type</span> integer)
                       (role-id <span class="org-builtin">:type</span> integer)
                       (grant-date <span class="org-builtin">:type</span> (or time db-null)))))

</pre>
</div>
</div>
</div>

<div id="outline-container-foreign-keys" class="outline-3">
<h3 id="foreign-keys">Adding Foreign Keys</h3>
<div class="outline-text-3" id="text-foreign-keys">
<p>
There are a few different ways to add foreign keys in postgresql when defining a table.
</p>
</div>

<div id="outline-container-foreign-keys-at-column" class="outline-4">
<h4 id="foreign-keys-at-column">Defining Foreign Keys at the Column Level</h4>
<div class="outline-text-4" id="text-foreign-keys-at-column">
<p>
First with foreign key on the column. Use the keyword :references and specify the table name and the relevant column within the subform. You will see why the subform in a minute.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:create-table</span> 'so-items
                      ((item-id <span class="org-builtin">:type</span> integer)
                       (so-id <span class="org-builtin">:type</span> (or integer db-null)
                              <span class="org-builtin">:references</span> ((so-headers id)))
                       (product-id <span class="org-builtin">:type</span> (or integer db-null))
                       (qty <span class="org-builtin">:type</span> (or integer db-null))
                       (net-price <span class="org-builtin">:type</span> (or numeric db-null)))
                      (<span class="org-builtin">:primary-key</span> item-id so-id)))

</pre>
</div>

<p>
If the foreign key references a group of columns in the foreign table, those fit into that same subform.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:create-table</span> 'so-items
                      ((item-id <span class="org-builtin">:type</span> integer)
                       (so-id <span class="org-builtin">:type</span> (or integer db-null)
                              <span class="org-builtin">:references</span> ((so-headers id p1 p2)))
                       (product-id <span class="org-builtin">:type</span> (or integer db-null))
                       (qty <span class="org-builtin">:type</span> (or integer db-null))
                       (net-price <span class="org-builtin">:type</span> (or numeric db-null)))
                      (<span class="org-builtin">:primary-key</span> item-id so-id)))

</pre>
</div>

<p>
You can specify the actions to be taken if a row in the foreign table is deleted or updated. Per the postgresql documentation:
</p>

<p>
" when the data in the referenced columns is changed, certain actions are performed on the data in this table's columns. The ON DELETE clause specifies the action to perform when a referenced row in the referenced table is being deleted. Likewise, the ON UPDATE clause specifies the action to perform when a referenced column in the referenced table is being updated to a new value. If the row is updated, but the referenced column is not actually changed, no action is done. Referential actions other than the NO ACTION check cannot be deferred, even if the constraint is declared deferrable. There are the following possible actions for each clause:
</p>

<p>
NO ACTION
</p>

<p>
Produce an error indicating that the deletion or update would create a foreign key constraint violation. If the constraint is deferred, this error will be produced at constraint check time if there still exist any referencing rows. This is the default action in postgresql but the default in postmodern is restrict.
</p>

<p>
RESTRICT
</p>

<p>
Produce an error indicating that the deletion or update would create a foreign key constraint violation. This is the same as NO ACTION except that the check is not deferrable.
</p>

<p>
CASCADE
</p>

<p>
Delete any rows referencing the deleted row, or update the values of the referencing column(s) to the new values of the referenced columns, respectively.
</p>

<p>
SET NULL
</p>

<p>
Set the referencing column(s) to null.
</p>

<p>
SET DEFAULT
</p>

<p>
Set the referencing column(s) to their default values. (There must be a row in the referenced table matching the default values, if they are not null, or the operation will fail.)
</p>

<p>
If the referenced column(s) are changed frequently, it might be wise to add an index to the referencing column(s) so that referential actions associated with the foreign key constraint can be performed more efficiently."
</p>

<p>
So now examples with specifying the on-delete and on-update actions.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:create-table</span> 'so-items
                      ((item-id <span class="org-builtin">:type</span> integer)
                       (so-id <span class="org-builtin">:type</span> (or integer db-null)
                              <span class="org-builtin">:references</span> ((so-headers id) <span class="org-builtin">:no-action</span> <span class="org-builtin">:no-action</span>))
                       (product-id <span class="org-builtin">:type</span> (or integer db-null))
                       (qty <span class="org-builtin">:type</span> (or integer db-null))
                       (net-price <span class="org-builtin">:type</span> (or numeric db-null)))
                      (<span class="org-builtin">:primary-key</span> item-id so-id)))

</pre>
</div>
</div>
</div>
