doc/s-sql-c.org
*** Defining Foreign Keys at the Table Level
:PROPERTIES:
:CUSTOM_ID: foreign-keys-at-table
:END:
Instead of specifying the foreign keys at the column level, you can specify them at the table level, but of course that means you have to additionally specify which column in the current table is a foreign key.

The following example creates a named constraint and a foreign key at column role-id with a single column in the foreign table. The first example uses the default actions for on-delete and on-default. The second example shows non-default actions specified.
#+begin_src lisp
(query (:create-table 'account-role
                      ((user-id :type integer)
                       (role-id :type integer)
                       (grant-date :type (or timestamp-without-time-zone db-null)))
                      (:primary-key user-id role-id)
                      (:constraint account-role-role-id-fkey :foreign-key (role-id) (role role-id))))

(query (:create-table 'account-role
                      ((user-id :type integer)
                       (role-id :type integer)
                       (grant-date :type (or timestamp-without-time-zone db-null)))
                      (:primary-key user-id role-id)
                      (:constraint account-role-role-id-fkey :foreign-key (role-id) (role role-id) :no-action :no-action)))
#+end_src
Additional foreign keys can easily be added:
#+begin_src lisp
(query (:create-table 'account-role
                      ((user-id :type integer)
                       (role-id :type integer)
                       (grant-date :type (or timestamp-without-time-zone db-null)))
                      (:primary-key user-id role-id)
                      (:constraint account-role-role-id-fkey :foreign-key (role-id) (role role-id))
                      (:constraint account-role-user-id-fkey :foreign-key (user-id) (users user-id))))

#+end_src
** Generated Columns
:PROPERTIES:
:CUSTOM_ID: generated-columns
:END:
It is sometimes useful to have a [[https://www.postgresql.org/docs/current/ddl-generated-columns.html][generated column]] that is computed from something else. An example would be a tsvector type column which might be generated as in this example:
#+begin_src lisp
  (query (:create-table 't10
                        ((title :type (or text db-null))
                         (body :type (or text db-null))
                         (tsv :type (or tsvector db-null)
                              :generated-always
                              (:to-tsvector "english" 'body)))))
#+end_src
The following example uses a calculation from fields in the tuple:
#+begin_src lisp
  (query (:create-table 't1
                        ((w :type (or real db-null))
                         (h :type (or real db-null))
                         (area :type (or real db-null)
                               :generated-always (:* 'w 'h)))))
#+end_src
The final example uses a variable in the calculation of the generated column:
#+begin_src lisp
  (let ((fx-rate 0.8))
         (query
          (:create-table 'cars
                         ((car-id :type (or int db-null))
                          (brand-name :type varchar)
                          (price-in-dollar :type (or numeric db-null)) (price-in-pound :type (or numeric db-null) :generated-always (:* 'price-in-dollar fx-rate))))))
#+end_src
