doc/s-sql-c.html

<div id="outline-container-foreign-keys-at-table" class="outline-4">
<h4 id="foreign-keys-at-table">Defining Foreign Keys at the Table Level</h4>
<div class="outline-text-4" id="text-foreign-keys-at-table">
<p>
Instead of specifying the foreign keys at the column level, you can specify them at the table level, but of course that means you have to additionally specify which column in the current table is a foreign key.
</p>

<p>
The following example creates a named constraint and a foreign key at column role-id with a single column in the foreign table. The first example uses the default actions for on-delete and on-default. The second example shows non-default actions specified.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:create-table</span> 'account-role
                      ((user-id <span class="org-builtin">:type</span> integer)
                       (role-id <span class="org-builtin">:type</span> integer)
                       (grant-date <span class="org-builtin">:type</span> (or timestamp-without-time-zone db-null)))
                      (<span class="org-builtin">:primary-key</span> user-id role-id)
                      (<span class="org-builtin">:constraint</span> account-role-role-id-fkey <span class="org-builtin">:foreign-key</span> (role-id) (role role-id))))

(query (<span class="org-builtin">:create-table</span> 'account-role
                      ((user-id <span class="org-builtin">:type</span> integer)
                       (role-id <span class="org-builtin">:type</span> integer)
                       (grant-date <span class="org-builtin">:type</span> (or timestamp-without-time-zone db-null)))
                      (<span class="org-builtin">:primary-key</span> user-id role-id)
                      (<span class="org-builtin">:constraint</span> account-role-role-id-fkey <span class="org-builtin">:foreign-key</span> (role-id) (role role-id) <span class="org-builtin">:no-action</span> <span class="org-builtin">:no-action</span>)))
</pre>
</div>
<p>
Additional foreign keys can easily be added:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:create-table</span> 'account-role
                      ((user-id <span class="org-builtin">:type</span> integer)
                       (role-id <span class="org-builtin">:type</span> integer)
                       (grant-date <span class="org-builtin">:type</span> (or timestamp-without-time-zone db-null)))
                      (<span class="org-builtin">:primary-key</span> user-id role-id)
                      (<span class="org-builtin">:constraint</span> account-role-role-id-fkey <span class="org-builtin">:foreign-key</span> (role-id) (role role-id))
                      (<span class="org-builtin">:constraint</span> account-role-user-id-fkey <span class="org-builtin">:foreign-key</span> (user-id) (users user-id))))

</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-generated-columns" class="outline-3">
<h3 id="generated-columns">Generated Columns</h3>
<div class="outline-text-3" id="text-generated-columns">
<p>
It is sometimes useful to have a <a href="https://www.postgresql.org/docs/current/ddl-generated-columns.html">generated column</a> that is computed from something else. An example would be a tsvector type column which might be generated as in this example:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:create-table</span> 't10
                      ((title <span class="org-builtin">:type</span> (or text db-null))
                       (body <span class="org-builtin">:type</span> (or text db-null))
                       (tsv <span class="org-builtin">:type</span> (or tsvector db-null)
                            <span class="org-builtin">:generated-always</span>
                            (<span class="org-builtin">:to-tsvector</span> <span class="org-string">"english"</span> 'body)))))
</pre>
</div>
<p>
The following example uses a calculation from fields in the tuple:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:create-table</span> 't1
                      ((w <span class="org-builtin">:type</span> (or real db-null))
                       (h <span class="org-builtin">:type</span> (or real db-null))
                       (area <span class="org-builtin">:type</span> (or real db-null)
                             <span class="org-builtin">:generated-always</span> (<span class="org-builtin">:*</span> 'w 'h)))))
</pre>
</div>
<p>
The final example uses a variable in the calculation of the generated column:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(<span class="org-keyword">let</span> ((fx-rate 0.8))
       (query
        (<span class="org-builtin">:create-table</span> 'cars
                       ((car-id <span class="org-builtin">:type</span> (or int db-null))
                        (brand-name <span class="org-builtin">:type</span> varchar)
                        (price-in-dollar <span class="org-builtin">:type</span> (or numeric db-null)) (price-in-pound <span class="org-builtin">:type</span> (or numeric db-null) <span class="org-builtin">:generated-always</span> (<span class="org-builtin">:*</span> 'price-in-dollar fx-rate))))))
</pre>
</div>
</div>
</div>
</div>
</div>
</body>
</html>